hananddong/ble_uwb_code/UWB_BLE_nrf52832/external/infineon/optiga_comms/ifx_i2c/ifx_i2c_physical_layer.c
/**
    \copyright
    Copyright (c) 2018, Infineon Technologies AG
    All rights reserved.

    This software is provided with terms and conditions as specified in OPTIGA(TM) Trust X Evaluation Kit License Agreement.
    \endcopyright

    \author Infineon AG

    \file ifx_i2c_physical_layer.c

    \brief   This file implements the IFX I2C Physical Layer.

    \addtogroup  grIFXI2C
    @{
*/

/***********************************************************************************************************************
    HEADER FILES
**********************************************************************************************************************/
#include "ifx_i2c_physical_layer.h"
#include "pal_os_event.h"

/// @cond hidden
/***********************************************************************************************************************
    MACROS
**********************************************************************************************************************/
// Physical Layer Register addresses
#define PL_REG_DATA                     (0x80)
#define PL_REG_DATA_REG_LEN             (0x81)
#define PL_REG_I2C_STATE                (0x82)
#define PL_REG_BASE_ADDR                (0x83)
#define PL_REG_MAX_SCL_FREQU            (0x84)
#define PL_REG_SOFT_RESET               (0x88)
#define PL_REG_I2C_MODE                 (0x89)

// Physical Layer Register lengths
#define PL_REG_LEN_I2C_STATE            (4)
#define PL_REG_LEN_MAX_SCL_FREQU        (4)
#define PL_REG_LEN_I2C_MODE             (2)
#define PL_REG_LEN_DATA_REG_LEN         (2)
#define PL_REG_LEN_SOFT_RESET           (2)
#define PL_REG_LEN_BASE_ADDR            (2)

// Physical Layer State Register masks
#define PL_REG_I2C_STATE_RESPONSE_READY (0x40)
#define PL_REG_I2C_STATE_SOFT_RESET     (0x08)

// Physical Layer low level interface constants
#define PL_ACTION_READ_REGISTER         (0x01)
#define PL_ACTION_WRITE_REGISTER        (0x02)
#define PL_I2C_CMD_WRITE                (0x01)
#define PL_I2C_CMD_READ                 (0x02)

// Physical Layer high level interface constants
#define PL_ACTION_WRITE_FRAME           (0x01)
#define PL_ACTION_READ_FRAME            (0x02)
#define PL_STATE_UNINIT                 (0x00)
#define PL_STATE_INIT                   (0x01)
#define PL_STATE_READY                  (0x02)
#define PL_STATE_DATA_AVAILABLE         (0x03)
#define PL_STATE_RXTX                   (0x04)
#define PL_STATE_SOFT_RESET             (0x05)

//Physical Layer negotiation constants
#define PL_INIT_SET_DATA_REG_LEN        (0x11)
#define PL_INIT_GET_DATA_REG_LEN        (0x22)
#define PL_INIT_GET_FREQ_REG            (0x33)
#define PL_INIT_SET_FREQ_REG            (0x44)
#define PL_INIT_READ_FREQ               (0x55)
#define PL_INIT_VERIFY_FREQ             (0x66)
#define PL_INIT_AGREE_FREQ              (0x77)
#define PL_INIT_VERIFY_DATA_REG         (0x88)
#define PL_INIT_GET_STATUS_REG          (0x99)
#define PL_INIT_DONE                    (0xAA)
#define PL_INIT_SET_FREQ_DEFAULT        (0xBB)

//Physical layer soft reset states
#define PL_RESET_INIT                   (0xA1)
#define PL_RESET_WRITE                  (0xA2)
#define PL_RESET_STARTUP                (0xA3)

#define PL_REG_I2C_MODE_PERSISTANT      (0x80)
#define PL_REG_I2C_MODE_SM_FM           (0x03)
#define PL_REG_I2C_MODE_FM_PLUS         (0x04)
#define PL_SM_FM_MAX_FREQUENCY          (0x190)
#define PL_DEFAULT_FREQUENCY            (0x64)
#define PL_REG_BASE_ADDR_PERSISTANT     (0x80)
#define PL_REG_BASE_ADDR_VOLATILE       (0x00)

// Physical Layer Base Address Register mask
#define PL_REG_I2C_BASE_ADDRESS_MASK     (0x7F)

// Setup debug log statements
#if IFX_I2C_LOG_PL == 1
    #define LOG_PL IFX_I2C_LOG
#else
    #define LOG_PL(...) //printf(__VA_ARGS__)
#endif
/***********************************************************************************************************************
    ENUMS
**********************************************************************************************************************/
/***********************************************************************************************************************
    DATA STRUCTURES
***********************************************************************************************************************/
/***********************************************************************************************************************
    GLOBAL
***********************************************************************************************************************/

static host_lib_status_t pal_event_status;

/***********************************************************************************************************************
    LOCAL ROUTINES
***********************************************************************************************************************/
/// Physical Layer low level interface function
static void ifx_i2c_pl_read_register(ifx_i2c_context_t *p_ctx, uint8_t reg_addr, uint16_t reg_len);
/// Physical Layer low level interface function
static void ifx_i2c_pl_write_register(ifx_i2c_context_t *p_ctx, uint8_t reg_addr, uint16_t reg_len, const uint8_t *p_content);
/// Physical Layer high level interface timer callback (Status register polling)
static void ifx_i2c_pl_status_poll_callback(void *p_ctx);
/// Physical Layer intermediate state machine (Negotiation with slave)
static void ifx_i2c_pl_negotiation_event_handler(void *p_input_ctx);
/// Physical Layer intermediate state machine(Set bit rate)
static host_lib_status_t ifx_i2c_pl_set_bit_rate(ifx_i2c_context_t *p_ctx, uint16_t bitrate);
/// Physical Layer intermediate state machine (soft reset)
static void ifx_i2c_pl_soft_reset(ifx_i2c_context_t *p_ctx);
/// Physical Layer high level interface state machine (read/write frames)
static void ifx_i2c_pl_frame_event_handler(ifx_i2c_context_t *p_ctx, host_lib_status_t event);
/// Physical Layer low level interface timer callback (I2C Nack/Busy polling)
static void ifx_i2c_pal_poll_callback(void *p_ctx);
/// Physical Layer low level guard time callback
static void ifx_i2c_pl_guard_time_callback(void *p_ctx);
/// Physical Layer low level interface state machine (read/write registers)
static void ifx_i2c_pl_pal_event_handler(void *p_ctx, host_lib_status_t event);
/// Physical layer low level event handler for set slave address
static void ifx_i2c_pl_pal_slave_addr_event_handler(void *p_input_ctx, host_lib_status_t event);

/// @endcond
/***********************************************************************************************************************
    API PROTOTYPES
**********************************************************************************************************************/
/// Physical Layer high level interface function
host_lib_status_t ifx_i2c_pl_init(ifx_i2c_context_t *p_ctx, ifx_i2c_event_handler_t handler)
{
    LOG_PL("[IFX-PL]: Init\n");
    
    p_ctx->pl.upper_layer_event_handler = handler;
    p_ctx->pl.frame_state = PL_STATE_UNINIT;
    p_ctx->pl.negotiate_state = PL_INIT_SET_FREQ_DEFAULT;
    p_ctx->p_pal_i2c_ctx->slave_address = p_ctx->slave_address;
    p_ctx->p_pal_i2c_ctx->upper_layer_event_handler = (void *) ifx_i2c_pl_pal_event_handler;
    p_ctx->pl.retry_counter = PL_POLLING_MAX_CNT;
    
    if(TRUE == p_ctx->do_pal_init)
    {
        // Initialize I2C driver
        if(PAL_STATUS_SUCCESS != pal_i2c_init(p_ctx->p_pal_i2c_ctx))
            return IFX_I2C_STACK_ERROR;
    }
    
