hananddong/ble_uwb_code/UWB_BLE_nrf52832/external/infineon/optiga_comms/ifx_i2c/ifx_i2c_physical_layer.c
    // Set Physical Layer internal state
    if(p_ctx->pl.request_soft_reset == (uint8_t)TRUE)
    {
        //Set the soft reset request to initial state to read register
        p_ctx->pl.request_soft_reset = PL_INIT_GET_STATUS_REG;
        p_ctx->pl.frame_state = PL_STATE_SOFT_RESET;
    }
    
    else
        p_ctx->pl.frame_state = PL_STATE_INIT;
        
    ifx_i2c_pl_frame_event_handler(p_ctx, IFX_I2C_STACK_SUCCESS);
    
    return IFX_I2C_STACK_SUCCESS;
}

/// Physical Layer high level interface function
host_lib_status_t ifx_i2c_pl_send_frame(ifx_i2c_context_t *p_ctx, uint8_t *p_frame, uint16_t frame_len)
{
    // Physical Layer must be idle, set requested action
    if(p_ctx->pl.frame_state != PL_STATE_INIT && p_ctx->pl.frame_state != PL_STATE_READY)
        return IFX_I2C_STACK_ERROR;
        
    p_ctx->pl.frame_action = PL_ACTION_WRITE_FRAME;
    
    // Store reference to frame for sending it later
    p_ctx->pl.p_tx_frame   = p_frame;
    p_ctx->pl.tx_frame_len = frame_len;
    
    ifx_i2c_pl_frame_event_handler(p_ctx, IFX_I2C_STACK_SUCCESS);
    return IFX_I2C_STACK_SUCCESS;
}

/// Physical Layer high level interface function
host_lib_status_t ifx_i2c_pl_receive_frame(ifx_i2c_context_t *p_ctx)
{
    // Physical Layer must be idle, set requested action
    if(p_ctx->pl.frame_state != PL_STATE_INIT && p_ctx->pl.frame_state != PL_STATE_READY)
        return IFX_I2C_STACK_ERROR;
        
    p_ctx->pl.frame_action = PL_ACTION_READ_FRAME;
    
    ifx_i2c_pl_frame_event_handler(p_ctx, IFX_I2C_STACK_SUCCESS);
    return IFX_I2C_STACK_SUCCESS;
}

host_lib_status_t ifx_i2c_pl_write_slave_address(ifx_i2c_context_t *p_ctx, uint8_t slave_address, uint8_t persistent)
{
    host_lib_status_t status = IFX_I2C_STACK_ERROR;
    app_event_handler_t *temp_upper_layer_event_handler;
    
    /// @cond hidden
#define PAL_WRITE_INIT_STATUS      (0x00FF)
#define ADDRESS_OFFSET              (0x02)
#define BASE_ADDRESS_REG_OFFSET     (0x00)
#define MODE_OFFSET                 (0x01)
#define POLLING_INTERVAL            (0x01)
#define DELAY_FOR_COMPLETION        (0x0A)
    /// @endcond
    
    //lint --e{611} suppress "void* function pointer is type casted to app_event_handler_t type"
    //ifx i2c wrapper api for setting slave address in synchronous. hence the event handler is backed up.
    temp_upper_layer_event_handler = (app_event_handler_t *)(p_ctx->p_pal_i2c_ctx->upper_layer_event_handler);
    //since the lower level APIs are asynchronous, a temporary event handler for set slave address is assigned
    p_ctx->p_pal_i2c_ctx->upper_layer_event_handler = (void *) ifx_i2c_pl_pal_slave_addr_event_handler;
    
    p_ctx->pl.buffer[BASE_ADDRESS_REG_OFFSET] = PL_REG_BASE_ADDR;
    p_ctx->pl.buffer[MODE_OFFSET] = PL_REG_BASE_ADDR_VOLATILE;
    //supported base addresses are 0x00 - 0x7F. Hence 8th bit is ignored
    p_ctx->pl.buffer[ADDRESS_OFFSET] = slave_address & PL_REG_I2C_BASE_ADDRESS_MASK;
    p_ctx->pl.buffer_tx_len = 1 + PL_REG_LEN_BASE_ADDR;
    
    if(PL_REG_BASE_ADDR_VOLATILE != persistent)
        p_ctx->pl.buffer[MODE_OFFSET] = PL_REG_BASE_ADDR_PERSISTANT;
        
    p_ctx->pl.retry_counter   = PL_POLLING_MAX_CNT;
    
    while(p_ctx->pl.retry_counter)
    {
        pal_event_status = PAL_WRITE_INIT_STATUS;
        
        //lint --e{534} suppress "Return value is not required to be checked"
        pal_i2c_write(p_ctx->p_pal_i2c_ctx, p_ctx->pl.buffer, p_ctx->pl.buffer_tx_len);
        
        while(PAL_WRITE_INIT_STATUS == pal_event_status) {};
        
        if(PAL_I2C_EVENT_SUCCESS == pal_event_status)
            break;
            
        p_ctx->pl.retry_counter--;
        pal_os_timer_delay_in_milliseconds(POLLING_INTERVAL);
    }
    
    if(PAL_I2C_EVENT_SUCCESS == pal_event_status)
    {
        p_ctx->p_pal_i2c_ctx->slave_address = p_ctx->pl.buffer[ADDRESS_OFFSET];
        
        if(PL_REG_BASE_ADDR_VOLATILE != persistent)
            p_ctx->slave_address = p_ctx->pl.buffer[ADDRESS_OFFSET];
            
        pal_os_timer_delay_in_milliseconds(DELAY_FOR_COMPLETION);
        status = IFX_I2C_STACK_SUCCESS;
    }
    
    //restoring the backed up event handler
    p_ctx->p_pal_i2c_ctx->upper_layer_event_handler = temp_upper_layer_event_handler;
    
    /// @cond hidden
#undef PAL_WRITE_INIT_STATUS
#undef ADDRESS_OFFSET
#undef BASE_ADDRESS_REG_OFFSET
#undef MODE_OFFSET
#undef POLLING_INTERVAL
#undef DELAY_FOR_COMPLETION
    /// @endcond
    
    return status;
}

static void ifx_i2c_pl_read_register(ifx_i2c_context_t *p_ctx, uint8_t reg_addr, uint16_t reg_len)
{
    LOG_PL("[IFX-PL]: Read register %x len %d\n", reg_addr, reg_len);
    
    // Prepare transmit buffer to write register address
    p_ctx->pl.buffer[0]     = reg_addr;
    p_ctx->pl.buffer_tx_len = 1;
    
    // Set low level interface variables and start transmission
    p_ctx->pl.buffer_rx_len   = reg_len;
    p_ctx->pl.register_action = PL_ACTION_READ_REGISTER;
    p_ctx->pl.retry_counter   = PL_POLLING_MAX_CNT;
    p_ctx->pl.i2c_cmd         = PL_I2C_CMD_WRITE;
    
    //lint --e{534} suppress "Return value is not required to be checked"
    pal_i2c_write(p_ctx->p_pal_i2c_ctx, p_ctx->pl.buffer, p_ctx->pl.buffer_tx_len);
}


static void ifx_i2c_pl_write_register(ifx_i2c_context_t *p_ctx, uint8_t reg_addr, uint16_t reg_len, const uint8_t *p_content)
{
    LOG_PL("[IFX-PL]: Write register %x len %d\n", reg_addr, reg_len);
    
    // Prepare transmit buffer to write register address and content
    p_ctx->pl.buffer[0] = reg_addr;
    memcpy(p_ctx->pl.buffer + 1, p_content, reg_len);
    p_ctx->pl.buffer_tx_len = 1 + reg_len;
    
    // Set Physical Layer low level interface variables and start transmission
    p_ctx->pl.register_action = PL_ACTION_WRITE_REGISTER;
    p_ctx->pl.retry_counter   = PL_POLLING_MAX_CNT;
    p_ctx->pl.i2c_cmd         = PL_I2C_CMD_WRITE;
    //lint --e{534} suppress "Return value is not required to be checked"
    pal_i2c_write(p_ctx->p_pal_i2c_ctx, p_ctx->pl.buffer, p_ctx->pl.buffer_tx_len);
}


static void ifx_i2c_pl_status_poll_callback(void *p_ctx)
{
    LOG_PL("[IFX-PL]: Status poll Timer elapsed  -> Read STATUS register\n");
    ifx_i2c_pl_read_register((ifx_i2c_context_t *)p_ctx, PL_REG_I2C_STATE, PL_REG_LEN_I2C_STATE);
}

