hananddong/ble_uwb_code/UWB_BLE_nrf52832/external/infineon/optiga_comms/ifx_i2c/ifx_i2c_physical_layer.c
static host_lib_status_t ifx_i2c_pl_set_bit_rate(ifx_i2c_context_t *p_ctx, uint16_t bitrate)
{
    host_lib_status_t status;
    void *pal_ctx_upper_layer_handler;
    // Save upper layer context in pal
    pal_ctx_upper_layer_handler = p_ctx->p_pal_i2c_ctx->upper_layer_event_handler;
    // Pass context as NULL to avoid callback invocation
    p_ctx->p_pal_i2c_ctx->upper_layer_event_handler  = NULL;
    status = pal_i2c_set_bitrate(p_ctx->p_pal_i2c_ctx, bitrate);
    // Restore callback
    p_ctx->p_pal_i2c_ctx->upper_layer_event_handler  = pal_ctx_upper_layer_handler;
    
    if(PAL_I2C_EVENT_SUCCESS != status)
    {
        if(p_ctx->pl.retry_counter--)
        {
            LOG_PL("[IFX-PL]: Set bit rate failed, Retry setting.\n");
            pal_os_event_register_callback_oneshot(ifx_i2c_pl_negotiation_event_handler, ((void *)p_ctx), PL_POLLING_INVERVAL_US);
            status = IFX_I2C_STACK_BUSY;
        }
        
        else
            status = IFX_I2C_STACK_ERROR;
    }
    
    else
        status = IFX_I2C_STACK_SUCCESS;
        
    return status;
    
}
static void ifx_i2c_pl_negotiation_event_handler(void *p_input_ctx)
{
    host_lib_status_t event = (uint8_t)IFX_I2C_STACK_ERROR;
    uint8_t continue_negotiation;
    ifx_i2c_context_t *p_ctx = (ifx_i2c_context_t *)p_input_ctx;
    uint8_t i2c_mode_value[2];
    uint8_t max_frame_size[2] = { (uint8_t)(p_ctx->frame_size >> 8), (uint8_t)(p_ctx->frame_size) };
    uint16_t buffer_len = 0;
    uint16_t slave_frequency;
    uint16_t slave_frame_len;
    uint8_t *p_buffer = NULL;
    
    do
    {
        continue_negotiation = FALSE;
        LOG_PL("[IFX-PL]: Negotiation started\n");
        
        switch(p_ctx->pl.negotiate_state)
        {
            // Set initial frequency to PL_DEFAULT_FREQUENCY to be able to negotiate with slave
            case PL_INIT_SET_FREQ_DEFAULT:
            {
                // Default frequency set to master
                event = ifx_i2c_pl_set_bit_rate(p_input_ctx, PL_DEFAULT_FREQUENCY);
                
                if(IFX_I2C_STACK_SUCCESS == event)
                {
                    p_ctx->pl.negotiate_state = PL_INIT_GET_FREQ_REG;
                    continue_negotiation = TRUE;
                }
                
                else if(IFX_I2C_STACK_ERROR == event)
                {
                    p_ctx->pl.negotiate_state = PL_INIT_DONE;
                    p_buffer = NULL;
                    buffer_len = 0;
                }
            }
            break;
            
            // Read the current Max frequency supported by slave
            case PL_INIT_GET_FREQ_REG:
            {
                p_ctx->pl.negotiate_state = PL_INIT_SET_FREQ_REG;
                ifx_i2c_pl_read_register(p_ctx, PL_REG_MAX_SCL_FREQU, PL_REG_LEN_MAX_SCL_FREQU);
            }
            break;
            
            // Set the I2C mode register
            case PL_INIT_SET_FREQ_REG:
            {
                slave_frequency = (p_ctx->pl.buffer[2] << 8) | p_ctx->pl.buffer[3];
                
                i2c_mode_value[0] = PL_REG_I2C_MODE_PERSISTANT;
                
                if((p_ctx->frequency > PL_SM_FM_MAX_FREQUENCY) && (slave_frequency <= PL_SM_FM_MAX_FREQUENCY))
                {
                    //Change to FM+ mode if slave's current supported frequency is below user's requested frequency
                    i2c_mode_value[1] = PL_REG_I2C_MODE_FM_PLUS;
                    p_ctx->pl.negotiate_state = PL_INIT_READ_FREQ;
                    ifx_i2c_pl_write_register(p_ctx, PL_REG_I2C_MODE, PL_REG_LEN_I2C_MODE, i2c_mode_value);
                }
                
                else if((p_ctx->frequency <= PL_SM_FM_MAX_FREQUENCY) && (slave_frequency > PL_SM_FM_MAX_FREQUENCY))
                {
                    //Change to SM&FM mode if slave's current supported frequency is above user's requested frequency
                    i2c_mode_value[1] = PL_REG_I2C_MODE_SM_FM;
                    p_ctx->pl.negotiate_state = PL_INIT_READ_FREQ;
                    ifx_i2c_pl_write_register(p_ctx, PL_REG_I2C_MODE, PL_REG_LEN_I2C_MODE, i2c_mode_value);
                }
                
                else
                {
                    p_ctx->pl.negotiate_state = PL_INIT_VERIFY_FREQ;
                    continue_negotiation = TRUE;
                }
            }
            break;
            
            // After setting I2C mode register, read the slave's supported frequency
            case PL_INIT_READ_FREQ:
            {
                p_ctx->pl.negotiate_state = PL_INIT_VERIFY_FREQ;
                ifx_i2c_pl_read_register(p_ctx, PL_REG_MAX_SCL_FREQU, PL_REG_LEN_MAX_SCL_FREQU);
            }
            break;
            
            // Verify the requested frequency and slave's supported frequency
            case PL_INIT_VERIFY_FREQ:
            {
                slave_frequency = (p_ctx->pl.buffer[2] << 8) | p_ctx->pl.buffer[3];
                
                if(p_ctx->frequency > slave_frequency)
                {
                    LOG_PL("[IFX-PL]: Unexpected frequency in MAX_SCL_FREQU\n");
                    p_buffer = NULL;
                    buffer_len = 0;
                    p_ctx->pl.negotiate_state = PL_INIT_DONE;
                }
                
                else
                    p_ctx->pl.negotiate_state = PL_INIT_AGREE_FREQ;
                    
                continue_negotiation = TRUE;
            }
            break;
            
            // Frequency negotiated, Set frequency at master
            case PL_INIT_AGREE_FREQ:
            {
                // Frequency negotiation between master and slave is complete
                event = ifx_i2c_pl_set_bit_rate(p_input_ctx, p_ctx->frequency);
                
                if(IFX_I2C_STACK_SUCCESS == event)
                {
                    p_ctx->pl.negotiate_state = PL_INIT_SET_DATA_REG_LEN;
                    continue_negotiation = TRUE;
                }
                
                else if(IFX_I2C_STACK_ERROR == event)
                {
                    p_ctx->pl.negotiate_state = PL_INIT_DONE;
                    p_buffer = NULL;
                    buffer_len = 0;
                }
            }
            break;
            
            // Start frame length negotiation by writing the requested frame length
            case PL_INIT_SET_DATA_REG_LEN:
            {
                p_ctx->pl.negotiate_state = PL_INIT_GET_DATA_REG_LEN;
                ifx_i2c_pl_write_register(p_ctx, PL_REG_DATA_REG_LEN, sizeof(max_frame_size), max_frame_size);
            }
            break;
            
            // Read the frame length to verify
            case PL_INIT_GET_DATA_REG_LEN:
            {
                p_ctx->pl.negotiate_state = PL_INIT_VERIFY_DATA_REG;
                ifx_i2c_pl_read_register(p_ctx, PL_REG_DATA_REG_LEN, PL_REG_LEN_DATA_REG_LEN);
            }
            break;
            
            // Check is slave accepted the new frame length
            case PL_INIT_VERIFY_DATA_REG:
            {
                p_ctx->pl.negotiate_state = PL_INIT_DONE;
                slave_frame_len = (p_ctx->pl.buffer[0] << 8) | p_ctx->pl.buffer[1];
                
                // Error if slave's frame length is more than requested frame length
                if(p_ctx->frame_size >= slave_frame_len)
                {
                    p_ctx->frame_size = slave_frame_len;
                    event = IFX_I2C_STACK_SUCCESS;
                }
                
                p_buffer = NULL;
                buffer_len = 0;
                continue_negotiation = TRUE;
            }
            break;
            
            case PL_INIT_DONE:
            {
                if(IFX_I2C_STACK_SUCCESS == event)
                    p_ctx->pl.frame_state = PL_STATE_READY;
                    
                else
                    p_ctx->pl.frame_state = PL_STATE_UNINIT;
                    
                // Negotiation between master and slave is complete
                p_ctx->pl.upper_layer_event_handler(p_ctx, event, p_buffer, buffer_len);
            }
            break;
            
            default:
                break;
        }
    } while(continue_negotiation);
}


static void ifx_i2c_pl_frame_event_handler(ifx_i2c_context_t *p_ctx, host_lib_status_t event)
{
    uint16_t frame_size;
    
    if(event != IFX_I2C_STACK_SUCCESS)
    {
        p_ctx->pl.frame_state = PL_STATE_READY;
        // I2C read or write failed, report to upper layer
        p_ctx->pl.upper_layer_event_handler(p_ctx, event, 0, 0);
    }
    
    else
    {
        switch(p_ctx->pl.frame_state)
        {
            // Perform soft reset
            case PL_STATE_SOFT_RESET:
            {
                ifx_i2c_pl_soft_reset(p_ctx);
            }
            break;
            
