hananddong/ble_uwb_code/UWB_BLE_nrf52832/external/infineon/optiga_comms/ifx_i2c/ifx_i2c_physical_layer.c
            // Negotiate frame and frequency with slave
            case PL_STATE_INIT:
            {
                ifx_i2c_pl_negotiation_event_handler(p_ctx);
            }
            break;
            
            // Check status of slave data
            case PL_STATE_READY:
            {
                // Start polling status register
                p_ctx->pl.frame_state           = PL_STATE_DATA_AVAILABLE;
                ifx_i2c_pl_read_register(p_ctx, PL_REG_I2C_STATE, PL_REG_LEN_I2C_STATE);
            }
            break;
            
            // Do read/write frame
            case PL_STATE_DATA_AVAILABLE:
            {
                // Read frame, if response is ready. Ignore busy flag
                if((p_ctx->pl.frame_action == PL_ACTION_READ_FRAME)
                   && (p_ctx->pl.buffer[0] & PL_REG_I2C_STATE_RESPONSE_READY))
                {
                    frame_size = (p_ctx->pl.buffer[2] << 8) | p_ctx->pl.buffer[3];
                    
                    if((frame_size > 0) && (frame_size <= p_ctx->frame_size))
                    {
                        p_ctx->pl.frame_state = PL_STATE_RXTX;
                        ifx_i2c_pl_read_register(p_ctx, PL_REG_DATA, frame_size);
                    }
                    
                    else
                    {
                        // Continue polling STATUS register if retry limit is not reached
                        if((pal_os_timer_get_time_in_milliseconds() - p_ctx->dl.frame_start_time) < p_ctx->dl.data_poll_timeout)
                            pal_os_event_register_callback_oneshot(ifx_i2c_pl_status_poll_callback, (void *)p_ctx, PL_DATA_POLLING_INVERVAL_US);
                            
                        else
                        {
                            p_ctx->pl.frame_state = PL_STATE_READY;
                            p_ctx->pl.upper_layer_event_handler(p_ctx, IFX_I2C_STACK_ERROR, 0, 0);
                        }
                    }
                }
                
                // Write frame is slave is not busy
                else if(p_ctx->pl.frame_action == PL_ACTION_WRITE_FRAME)
                {
                    // Write frame if device is not busy, otherwise wait and poll STATUS again later
                    p_ctx->pl.frame_state = PL_STATE_RXTX;
                    ifx_i2c_pl_write_register(p_ctx, PL_REG_DATA, p_ctx->pl.tx_frame_len, (uint8_t *)p_ctx->pl.p_tx_frame);
                }
                
                // Continue checking the slave status register
                else
                {
                    // Continue polling STATUS register if retry limit is not reached
                    if((pal_os_timer_get_time_in_milliseconds() - p_ctx->dl.frame_start_time) < p_ctx->dl.data_poll_timeout)
                        pal_os_event_register_callback_oneshot(ifx_i2c_pl_status_poll_callback, (void *)p_ctx, PL_DATA_POLLING_INVERVAL_US);
                        
                    else
                    {
                        p_ctx->pl.frame_state = PL_STATE_READY;
                        p_ctx->pl.upper_layer_event_handler(p_ctx, IFX_I2C_STACK_ERROR, 0, 0);
                    }
                }
            }
            break;
            
            // Frame reading is complete
            case PL_STATE_RXTX:
            {
                // Writing/reading of frame to/from DATA register complete
                p_ctx->pl.frame_state = PL_STATE_READY;
                p_ctx->pl.upper_layer_event_handler(p_ctx, IFX_I2C_STACK_SUCCESS, p_ctx->pl.buffer, p_ctx->pl.buffer_rx_len);
            }
            break;
            
            default:
                break;
        }
    }
}

static void ifx_i2c_pal_poll_callback(void *p_ctx)
{
    ifx_i2c_context_t *p_local_ctx = (ifx_i2c_context_t *)p_ctx;
    
    if(p_local_ctx->pl.i2c_cmd == PL_I2C_CMD_WRITE)
    {
        LOG_PL("[IFX-PL]: Poll Timer elapsed -> Restart TX\n");
        //lint --e{534} suppress "Return value is not required to be checked"
        pal_i2c_write(p_local_ctx->p_pal_i2c_ctx, p_local_ctx->pl.buffer, p_local_ctx->pl.buffer_tx_len);
    }
    
    else if(p_local_ctx->pl.i2c_cmd == PL_I2C_CMD_READ)
    {
        LOG_PL("[IFX-PL]: Poll Timer elapsed  -> Restart Read Register -> Start TX\n");
        //lint --e{534} suppress "Return value is not required to be checked"
        pal_i2c_read(p_local_ctx->p_pal_i2c_ctx, p_local_ctx->pl.buffer, p_local_ctx->pl.buffer_rx_len);
    }
}


static void ifx_i2c_pl_guard_time_callback(void *p_ctx)
{
    ifx_i2c_context_t *p_local_ctx = (ifx_i2c_context_t *)p_ctx;
    
    if(p_local_ctx->pl.register_action == PL_ACTION_READ_REGISTER)
    {
        if(p_local_ctx->pl.i2c_cmd == PL_I2C_CMD_WRITE)
        {
            LOG_PL("[IFX-PL]: GT done-> Start RX\n");
            p_local_ctx->pl.i2c_cmd = PL_I2C_CMD_READ;
            //lint --e{534} suppress "Return value is not required to be checked"
            pal_i2c_read(p_local_ctx->p_pal_i2c_ctx, p_local_ctx->pl.buffer, p_local_ctx->pl.buffer_rx_len);
        }
        
        else if(p_local_ctx->pl.i2c_cmd == PL_I2C_CMD_READ)
        {
            LOG_PL("[IFX-PL]: GT done -> REG is read\n");
            ifx_i2c_pl_frame_event_handler(p_local_ctx, IFX_I2C_STACK_SUCCESS);
        }
    }
    
    else if(p_local_ctx->pl.register_action == PL_ACTION_WRITE_REGISTER)
    {
        LOG_PL("[IFX-PL]: GT done -> REG written\n");
        ifx_i2c_pl_frame_event_handler(p_local_ctx, IFX_I2C_STACK_SUCCESS);
    }
}

static void ifx_i2c_pl_pal_event_handler(void *p_ctx, host_lib_status_t event)
{
    ifx_i2c_context_t *p_local_ctx = (ifx_i2c_context_t *)p_ctx;
    
    switch(event)
    {
        case PAL_I2C_EVENT_ERROR:
        case PAL_I2C_EVENT_BUSY:
        
            // Error event usually occurs when the device is in sleep mode and needs time to wake up
            if(p_local_ctx->pl.retry_counter--)
            {
                LOG_PL("[IFX-PL]: PAL Error -> Continue polling\n");
                pal_os_event_register_callback_oneshot(ifx_i2c_pal_poll_callback, p_local_ctx, PL_POLLING_INVERVAL_US);
            }
            
            else
            {
                LOG_PL("[IFX-PL]: PAL Error -> Stop\n");
                ifx_i2c_pl_frame_event_handler(p_local_ctx, IFX_I2C_FATAL_ERROR);
            }
            
            break;
            
        case PAL_I2C_EVENT_SUCCESS:
            LOG_PL("[IFX-PL]: PAL Success -> Wait Guard Time\n");
            pal_os_event_register_callback_oneshot(ifx_i2c_pl_guard_time_callback, p_local_ctx, PL_GUARD_TIME_INTERVAL_US);
            break;
            
        default:
            break;
    }
}


static void ifx_i2c_pl_soft_reset(ifx_i2c_context_t *p_ctx)
{
    uint8_t i2c_mode_value[2] = {0};
    
